Best val_accuracy So Far: 0.9625236988067627
Total elapsed time: 21h 33m 06s
Results summary
Results in auto_model\act_efficient_net_20210521172324
Showing 2 best trials
Objective(name='val_accuracy', direction='max')
Trial summary
Hyperparameters:
se_ratio: 0.25
conv_ops_1: conv
kernel_size_1: 3
skip_op_1: identity
layers_1: 2
conv_ops_2: mb_conv
kernel_size_2: 2
skip_op_2: identity
layers_2: 5
conv_ops_3: mb_conv
kernel_size_3: 3
skip_op_3: identity
layers_3: 5
conv_ops_4: conv
kernel_size_4: 5
skip_op_4: None
layers_4: 2
Score: 0.9625236988067627
Trial summary
Hyperparameters:
se_ratio: 0.25
conv_ops_1: conv
kernel_size_1: 3
skip_op_1: identity
layers_1: 2
conv_ops_2: mb_conv
kernel_size_2: 2
skip_op_2: identity
layers_2: 5
conv_ops_3: mb_conv
kernel_size_3: 3
skip_op_3: identity
layers_3: 5
conv_ops_4: sep_conv
kernel_size_4: 5
skip_op_4: None
layers_4: 2
Score: 0.9603890180587769

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 512, 3)]     0
__________________________________________________________________________________________________
stem_conv (Conv1D)              (None, 256, 32)      288         input_1[0][0]
__________________________________________________________________________________________________
stem_bn (BatchNormalization)    (None, 256, 32)      128         stem_conv[0][0]
__________________________________________________________________________________________________
stem_activation (Activation)    (None, 256, 32)      0           stem_bn[0][0]
__________________________________________________________________________________________________
block1a_conv (Conv1D)           (None, 256, 16)      1552        stem_activation[0][0]
__________________________________________________________________________________________________
block1b_conv (Conv1D)           (None, 256, 16)      784         block1a_conv[0][0]
__________________________________________________________________________________________________
block1_se_squeeze (GlobalAverag (None, 16)           0           block1b_conv[0][0]
__________________________________________________________________________________________________
block1_se_reshape (Reshape)     (None, 1, 16)        0           block1_se_squeeze[0][0]
__________________________________________________________________________________________________
block1_se_reduce (Conv1D)       (None, 1, 4)         68          block1_se_reshape[0][0]
__________________________________________________________________________________________________
block1_se_expand (Conv1D)       (None, 1, 16)        80          block1_se_reduce[0][0]
__________________________________________________________________________________________________
block1_se_excite (Multiply)     (None, 256, 16)      0           block1b_conv[0][0]
                                                                 block1_se_expand[0][0]
__________________________________________________________________________________________________
block1_shortcut (Conv1D)        (None, 256, 16)      272         block1_se_excite[0][0]
__________________________________________________________________________________________________
block1_add (Add)                (None, 256, 16)      0           block1_se_excite[0][0]
                                                                 block1_shortcut[0][0]
__________________________________________________________________________________________________
block2a_dwconv (SeparableConv1D (None, 128, 16)      288         block1_add[0][0]
__________________________________________________________________________________________________
block2a_bn (BatchNormalization) (None, 128, 16)      64          block2a_dwconv[0][0]
__________________________________________________________________________________________________
block2a_activation (Activation) (None, 128, 16)      0           block2a_bn[0][0]
__________________________________________________________________________________________________
block2a_se_squeeze (GlobalAvera (None, 16)           0           block2a_activation[0][0]
__________________________________________________________________________________________________
block2a_se_reshape (Reshape)    (None, 1, 16)        0           block2a_se_squeeze[0][0]
__________________________________________________________________________________________________
block2a_se_reduce (Conv1D)      (None, 1, 4)         68          block2a_se_reshape[0][0]
__________________________________________________________________________________________________
block2a_se_expand (Conv1D)      (None, 1, 16)        80          block2a_se_reduce[0][0]
__________________________________________________________________________________________________
block2a_se_excite (Multiply)    (None, 128, 16)      0           block2a_activation[0][0]
                                                                 block2a_se_expand[0][0]
__________________________________________________________________________________________________
block2a_project_conv (Conv1D)   (None, 128, 32)      512         block2a_se_excite[0][0]
__________________________________________________________________________________________________
block2a_project_bn (BatchNormal (None, 128, 32)      128         block2a_project_conv[0][0]
__________________________________________________________________________________________________
block2b_dwconv (SeparableConv1D (None, 128, 32)      1088        block2a_project_bn[0][0]
__________________________________________________________________________________________________
block2b_bn (BatchNormalization) (None, 128, 32)      128         block2b_dwconv[0][0]
__________________________________________________________________________________________________
block2b_activation (Activation) (None, 128, 32)      0           block2b_bn[0][0]
__________________________________________________________________________________________________
block2b_se_squeeze (GlobalAvera (None, 32)           0           block2b_activation[0][0]
__________________________________________________________________________________________________
block2b_se_reshape (Reshape)    (None, 1, 32)        0           block2b_se_squeeze[0][0]
__________________________________________________________________________________________________
block2b_se_reduce (Conv1D)      (None, 1, 8)         264         block2b_se_reshape[0][0]
__________________________________________________________________________________________________
block2b_se_expand (Conv1D)      (None, 1, 32)        288         block2b_se_reduce[0][0]
__________________________________________________________________________________________________
block2b_se_excite (Multiply)    (None, 128, 32)      0           block2b_activation[0][0]
                                                                 block2b_se_expand[0][0]
__________________________________________________________________________________________________
block2b_project_conv (Conv1D)   (None, 128, 32)      1024        block2b_se_excite[0][0]
__________________________________________________________________________________________________
block2b_project_bn (BatchNormal (None, 128, 32)      128         block2b_project_conv[0][0]
__________________________________________________________________________________________________
block2b_drop (Dropout)          (None, 128, 32)      0           block2b_project_bn[0][0]
__________________________________________________________________________________________________
block2b_add (Add)               (None, 128, 32)      0           block2b_drop[0][0]
                                                                 block2a_project_bn[0][0]
__________________________________________________________________________________________________
block2c_dwconv (SeparableConv1D (None, 128, 32)      1088        block2b_add[0][0]
__________________________________________________________________________________________________
block2c_bn (BatchNormalization) (None, 128, 32)      128         block2c_dwconv[0][0]
__________________________________________________________________________________________________
block2c_activation (Activation) (None, 128, 32)      0           block2c_bn[0][0]
__________________________________________________________________________________________________
block2c_se_squeeze (GlobalAvera (None, 32)           0           block2c_activation[0][0]
__________________________________________________________________________________________________
block2c_se_reshape (Reshape)    (None, 1, 32)        0           block2c_se_squeeze[0][0]
__________________________________________________________________________________________________
block2c_se_reduce (Conv1D)      (None, 1, 8)         264         block2c_se_reshape[0][0]
__________________________________________________________________________________________________
block2c_se_expand (Conv1D)      (None, 1, 32)        288         block2c_se_reduce[0][0]
__________________________________________________________________________________________________
block2c_se_excite (Multiply)    (None, 128, 32)      0           block2c_activation[0][0]
                                                                 block2c_se_expand[0][0]
__________________________________________________________________________________________________
block2c_project_conv (Conv1D)   (None, 128, 32)      1024        block2c_se_excite[0][0]
__________________________________________________________________________________________________
block2c_project_bn (BatchNormal (None, 128, 32)      128         block2c_project_conv[0][0]
__________________________________________________________________________________________________
block2c_drop (Dropout)          (None, 128, 32)      0           block2c_project_bn[0][0]
__________________________________________________________________________________________________
block2c_add (Add)               (None, 128, 32)      0           block2c_drop[0][0]
                                                                 block2b_add[0][0]
__________________________________________________________________________________________________
block2d_dwconv (SeparableConv1D (None, 128, 32)      1088        block2c_add[0][0]
__________________________________________________________________________________________________
block2d_bn (BatchNormalization) (None, 128, 32)      128         block2d_dwconv[0][0]
__________________________________________________________________________________________________
block2d_activation (Activation) (None, 128, 32)      0           block2d_bn[0][0]
__________________________________________________________________________________________________
block2d_se_squeeze (GlobalAvera (None, 32)           0           block2d_activation[0][0]
__________________________________________________________________________________________________
block2d_se_reshape (Reshape)    (None, 1, 32)        0           block2d_se_squeeze[0][0]
__________________________________________________________________________________________________
block2d_se_reduce (Conv1D)      (None, 1, 8)         264         block2d_se_reshape[0][0]
__________________________________________________________________________________________________
block2d_se_expand (Conv1D)      (None, 1, 32)        288         block2d_se_reduce[0][0]
__________________________________________________________________________________________________
block2d_se_excite (Multiply)    (None, 128, 32)      0           block2d_activation[0][0]
                                                                 block2d_se_expand[0][0]
__________________________________________________________________________________________________
block2d_project_conv (Conv1D)   (None, 128, 32)      1024        block2d_se_excite[0][0]
__________________________________________________________________________________________________
block2d_project_bn (BatchNormal (None, 128, 32)      128         block2d_project_conv[0][0]
__________________________________________________________________________________________________
block2d_drop (Dropout)          (None, 128, 32)      0           block2d_project_bn[0][0]
__________________________________________________________________________________________________
block2d_add (Add)               (None, 128, 32)      0           block2d_drop[0][0]
                                                                 block2c_add[0][0]
__________________________________________________________________________________________________
block2e_dwconv (SeparableConv1D (None, 128, 32)      1088        block2d_add[0][0]
__________________________________________________________________________________________________
block2e_bn (BatchNormalization) (None, 128, 32)      128         block2e_dwconv[0][0]
__________________________________________________________________________________________________
block2e_activation (Activation) (None, 128, 32)      0           block2e_bn[0][0]
__________________________________________________________________________________________________
block2e_se_squeeze (GlobalAvera (None, 32)           0           block2e_activation[0][0]
__________________________________________________________________________________________________
block2e_se_reshape (Reshape)    (None, 1, 32)        0           block2e_se_squeeze[0][0]
__________________________________________________________________________________________________
block2e_se_reduce (Conv1D)      (None, 1, 8)         264         block2e_se_reshape[0][0]
__________________________________________________________________________________________________
block2e_se_expand (Conv1D)      (None, 1, 32)        288         block2e_se_reduce[0][0]
__________________________________________________________________________________________________
block2e_se_excite (Multiply)    (None, 128, 32)      0           block2e_activation[0][0]
                                                                 block2e_se_expand[0][0]
__________________________________________________________________________________________________
block2e_project_conv (Conv1D)   (None, 128, 32)      1024        block2e_se_excite[0][0]
__________________________________________________________________________________________________
block2e_project_bn (BatchNormal (None, 128, 32)      128         block2e_project_conv[0][0]
__________________________________________________________________________________________________
block2e_drop (Dropout)          (None, 128, 32)      0           block2e_project_bn[0][0]
__________________________________________________________________________________________________
block2e_add (Add)               (None, 128, 32)      0           block2e_drop[0][0]
                                                                 block2d_add[0][0]
__________________________________________________________________________________________________
block3a_dwconv (SeparableConv1D (None, 64, 32)       1120        block2e_add[0][0]
__________________________________________________________________________________________________
block3a_bn (BatchNormalization) (None, 64, 32)       128         block3a_dwconv[0][0]
__________________________________________________________________________________________________
block3a_activation (Activation) (None, 64, 32)       0           block3a_bn[0][0]
__________________________________________________________________________________________________
block3a_se_squeeze (GlobalAvera (None, 32)           0           block3a_activation[0][0]
__________________________________________________________________________________________________
block3a_se_reshape (Reshape)    (None, 1, 32)        0           block3a_se_squeeze[0][0]
__________________________________________________________________________________________________
block3a_se_reduce (Conv1D)      (None, 1, 8)         264         block3a_se_reshape[0][0]
__________________________________________________________________________________________________
block3a_se_expand (Conv1D)      (None, 1, 32)        288         block3a_se_reduce[0][0]
__________________________________________________________________________________________________
block3a_se_excite (Multiply)    (None, 64, 32)       0           block3a_activation[0][0]
                                                                 block3a_se_expand[0][0]
__________________________________________________________________________________________________
block3a_project_conv (Conv1D)   (None, 64, 64)       2048        block3a_se_excite[0][0]
__________________________________________________________________________________________________
block3a_project_bn (BatchNormal (None, 64, 64)       256         block3a_project_conv[0][0]
__________________________________________________________________________________________________
block3b_dwconv (SeparableConv1D (None, 64, 64)       4288        block3a_project_bn[0][0]
__________________________________________________________________________________________________
block3b_bn (BatchNormalization) (None, 64, 64)       256         block3b_dwconv[0][0]
__________________________________________________________________________________________________
block3b_activation (Activation) (None, 64, 64)       0           block3b_bn[0][0]
__________________________________________________________________________________________________
block3b_se_squeeze (GlobalAvera (None, 64)           0           block3b_activation[0][0]
__________________________________________________________________________________________________
block3b_se_reshape (Reshape)    (None, 1, 64)        0           block3b_se_squeeze[0][0]
__________________________________________________________________________________________________
block3b_se_reduce (Conv1D)      (None, 1, 16)        1040        block3b_se_reshape[0][0]
__________________________________________________________________________________________________
block3b_se_expand (Conv1D)      (None, 1, 64)        1088        block3b_se_reduce[0][0]
__________________________________________________________________________________________________
block3b_se_excite (Multiply)    (None, 64, 64)       0           block3b_activation[0][0]
                                                                 block3b_se_expand[0][0]
__________________________________________________________________________________________________
block3b_project_conv (Conv1D)   (None, 64, 64)       4096        block3b_se_excite[0][0]
__________________________________________________________________________________________________
block3b_project_bn (BatchNormal (None, 64, 64)       256         block3b_project_conv[0][0]
__________________________________________________________________________________________________
block3b_drop (Dropout)          (None, 64, 64)       0           block3b_project_bn[0][0]
__________________________________________________________________________________________________
block3b_add (Add)               (None, 64, 64)       0           block3b_drop[0][0]
                                                                 block3a_project_bn[0][0]
__________________________________________________________________________________________________
block3c_dwconv (SeparableConv1D (None, 64, 64)       4288        block3b_add[0][0]
__________________________________________________________________________________________________
block3c_bn (BatchNormalization) (None, 64, 64)       256         block3c_dwconv[0][0]
__________________________________________________________________________________________________
block3c_activation (Activation) (None, 64, 64)       0           block3c_bn[0][0]
__________________________________________________________________________________________________
block3c_se_squeeze (GlobalAvera (None, 64)           0           block3c_activation[0][0]
__________________________________________________________________________________________________
block3c_se_reshape (Reshape)    (None, 1, 64)        0           block3c_se_squeeze[0][0]
__________________________________________________________________________________________________
block3c_se_reduce (Conv1D)      (None, 1, 16)        1040        block3c_se_reshape[0][0]
__________________________________________________________________________________________________
block3c_se_expand (Conv1D)      (None, 1, 64)        1088        block3c_se_reduce[0][0]
__________________________________________________________________________________________________
block3c_se_excite (Multiply)    (None, 64, 64)       0           block3c_activation[0][0]
                                                                 block3c_se_expand[0][0]
__________________________________________________________________________________________________
block3c_project_conv (Conv1D)   (None, 64, 64)       4096        block3c_se_excite[0][0]
__________________________________________________________________________________________________
block3c_project_bn (BatchNormal (None, 64, 64)       256         block3c_project_conv[0][0]
__________________________________________________________________________________________________
block3c_drop (Dropout)          (None, 64, 64)       0           block3c_project_bn[0][0]
__________________________________________________________________________________________________
block3c_add (Add)               (None, 64, 64)       0           block3c_drop[0][0]
                                                                 block3b_add[0][0]
__________________________________________________________________________________________________
block3d_dwconv (SeparableConv1D (None, 64, 64)       4288        block3c_add[0][0]
__________________________________________________________________________________________________
block3d_bn (BatchNormalization) (None, 64, 64)       256         block3d_dwconv[0][0]
__________________________________________________________________________________________________
block3d_activation (Activation) (None, 64, 64)       0           block3d_bn[0][0]
__________________________________________________________________________________________________
block3d_se_squeeze (GlobalAvera (None, 64)           0           block3d_activation[0][0]
__________________________________________________________________________________________________
block3d_se_reshape (Reshape)    (None, 1, 64)        0           block3d_se_squeeze[0][0]
__________________________________________________________________________________________________
block3d_se_reduce (Conv1D)      (None, 1, 16)        1040        block3d_se_reshape[0][0]
__________________________________________________________________________________________________
block3d_se_expand (Conv1D)      (None, 1, 64)        1088        block3d_se_reduce[0][0]
__________________________________________________________________________________________________
block3d_se_excite (Multiply)    (None, 64, 64)       0           block3d_activation[0][0]
                                                                 block3d_se_expand[0][0]
__________________________________________________________________________________________________
block3d_project_conv (Conv1D)   (None, 64, 64)       4096        block3d_se_excite[0][0]
__________________________________________________________________________________________________
block3d_project_bn (BatchNormal (None, 64, 64)       256         block3d_project_conv[0][0]
__________________________________________________________________________________________________
block3d_drop (Dropout)          (None, 64, 64)       0           block3d_project_bn[0][0]
__________________________________________________________________________________________________
block3d_add (Add)               (None, 64, 64)       0           block3d_drop[0][0]
                                                                 block3c_add[0][0]
__________________________________________________________________________________________________
block3e_dwconv (SeparableConv1D (None, 64, 64)       4288        block3d_add[0][0]
__________________________________________________________________________________________________
block3e_bn (BatchNormalization) (None, 64, 64)       256         block3e_dwconv[0][0]
__________________________________________________________________________________________________
block3e_activation (Activation) (None, 64, 64)       0           block3e_bn[0][0]
__________________________________________________________________________________________________
block3e_se_squeeze (GlobalAvera (None, 64)           0           block3e_activation[0][0]
__________________________________________________________________________________________________
block3e_se_reshape (Reshape)    (None, 1, 64)        0           block3e_se_squeeze[0][0]
__________________________________________________________________________________________________
block3e_se_reduce (Conv1D)      (None, 1, 16)        1040        block3e_se_reshape[0][0]
__________________________________________________________________________________________________
block3e_se_expand (Conv1D)      (None, 1, 64)        1088        block3e_se_reduce[0][0]
__________________________________________________________________________________________________
block3e_se_excite (Multiply)    (None, 64, 64)       0           block3e_activation[0][0]
                                                                 block3e_se_expand[0][0]
__________________________________________________________________________________________________
block3e_project_conv (Conv1D)   (None, 64, 64)       4096        block3e_se_excite[0][0]
__________________________________________________________________________________________________
block3e_project_bn (BatchNormal (None, 64, 64)       256         block3e_project_conv[0][0]
__________________________________________________________________________________________________
block3e_drop (Dropout)          (None, 64, 64)       0           block3e_project_bn[0][0]
__________________________________________________________________________________________________
block3e_add (Add)               (None, 64, 64)       0           block3e_drop[0][0]
                                                                 block3d_add[0][0]
__________________________________________________________________________________________________
block4a_conv (Conv1D)           (None, 64, 128)      41088       block3e_add[0][0]
__________________________________________________________________________________________________
block4b_conv (Conv1D)           (None, 64, 128)      82048       block4a_conv[0][0]
__________________________________________________________________________________________________
block4_se_squeeze (GlobalAverag (None, 128)          0           block4b_conv[0][0]
__________________________________________________________________________________________________
block4_se_reshape (Reshape)     (None, 1, 128)       0           block4_se_squeeze[0][0]
__________________________________________________________________________________________________
block4_se_reduce (Conv1D)       (None, 1, 32)        4128        block4_se_reshape[0][0]
__________________________________________________________________________________________________
block4_se_expand (Conv1D)       (None, 1, 128)       4224        block4_se_reduce[0][0]
__________________________________________________________________________________________________
block4_se_excite (Multiply)     (None, 64, 128)      0           block4b_conv[0][0]
                                                                 block4_se_expand[0][0]
__________________________________________________________________________________________________
top_conv (Conv1D)               (None, 64, 1280)     163840      block4_se_excite[0][0]
__________________________________________________________________________________________________
top_bn (BatchNormalization)     (None, 64, 1280)     5120        top_conv[0][0]
__________________________________________________________________________________________________
top_activation (Activation)     (None, 64, 1280)     0           top_bn[0][0]
__________________________________________________________________________________________________
avg_pool (GlobalAveragePooling1 (None, 1280)         0           top_activation[0][0]
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 1280)         0           avg_pool[0][0]
__________________________________________________________________________________________________
predictions (Dense)             (None, 6)            7686        dropout_3[0][0]
==================================================================================================
Total params: 372,326
Trainable params: 367,878
Non-trainable params: 4,448
__________________________________________________________________________________________________

Accuracy: 0.93146
